# Задача 6. Коледен турнир
# Напишете програма, която проследява представянето на вашия отбор на благотворителен коледен турнир.
# Всеки ден получавате имена на игри до команда "Finish". Със спечелването на всяка една игра печелите по 20лв.
# за благотворителност. Трябва да изчислите колко пари сте спечелили на края на деня. Ако имате повече спечелени игри,
# отколкото загубени – вие сте победители този ден и увеличавате парите от него с 10%. При приключване на турнира
# ако през повечето дни сте били победители печелите турнира и увеличавате всичките спечелени пари с 20%.
# Никога няма да имате равен брой спечелени и загубени игри.
# Вход
# Първоначално от конзолата се прочита броя дни на турнира – цяло число в интервала [1… 20]
# До получаване на командата "Finish" се чете:
# •	Спорт  – текст
# За всеки спорт се прочита:
# o	Резултат  – текст с възможности: "win" или "lose"

tournament_days = int(input())
win = 0
lose = 0
budget = 0
day_win = 0
day_lose = 0
day_budget = 0

for i in range(tournament_days):
    # ако през повечето дни сте били победители печелите турнира и увеличавате всичките спечелени пари с 20%

    command = input()
    result = input()
    while result != 'Finish':

        if result == "win":
            win += 1
            day_budget += 20
        elif result == "lose":
            lose += 1

        result = input()



    # Ако имате повече спечелени игри,
    # отколкото загубени – вие сте победители този ден и увеличавате парите от него с 10%
    if win > lose:
        day_budget *= 1.10
        day_win += 1
        budget += day_budget
        day_budget =0

    elif win < lose:
        day_lose += 1
        budget += day_budget
        day_budget = 0
    win = 0
    lose = 0
if day_win > day_lose:
    budget *= 1.20
    print(f"You won the tournament! Total raised money: {budget:.2f}")
else:
    print(f"You lost the tournament! Total raised money: {budget:.2f}")





# Изход
# Накрая се отпечатва един ред:
# •	Ако сте спечелили турнира:
#      	"You won the tournament! Total raised money: {спечелените пари}"
# •	Ако сте загубили на турнира:
# "You lost the tournament! Total raised money: {спечелените пари}"
# Парите да бъдат форматирани до втората цифра след десетичния знак.

