#     Задача 3. Художествена гимнастика
# На световно първенство по художествена гимнастика три от държавите се изявяват като лидери в класирането
#     (Русия, България, Италия). Вашата задача е да изчислите каква е оценката дадена от журито за конкретно съчетание,
#     като знаете държавата, която е играла и с кой уред е играла - лента, обръч или въже. За съчетанието си,
#     отбора е получил две оценки: оценка за трудност и оценка за изпълнение на съчетанието,
#     като крайната оценка е сбор на двете оценки.
#     В таблицата са показани какви оценки за трудност и изпълнение са получили ансамблите за всеки един уред.
#
# Напишете програма, която изчислява каква е оценката на дадена държава за определен уред и колко процента не им достигат,
#     за да имат максималната оценка, която е 20.
# Вход
# Входът се чете от конзолата и се състои от два реда:
# •	Първи ред – държава – текст ("Russia", "Bulgaria" или "Italy")
# •	Втори ред – уред - текст ("ribbon", "hoop" или "rope")

country = input()
device = input()
overall_estimates = 0
# Уред	                   Русия	         България	                Италия
# Лента(ribbon)	       Трудност: 9.100    Трудност: 9.600     Трудност: 9.200
#                       Изпълнение: 9.400  Изпълнение: 9.400   Изпълнение: 9.500

# Обръч(hoop)          Трудност: 9.300    Трудност: 9.550      Трудност: 9.450
#                      Изпълнение: 9.800   Изпълнение: 9.750    Изпълнение: 9.350

# Въже(rope)	       Трудност: 9.600    Трудност: 9.500       Трудност: 9.700
#                      Изпълнение: 9.000   Изпълнение: 9.400     Изпълнение: 9.150

if country == "Russia":
    if device == "ribbon":
        overall_estimates += 18.5
    elif device == "hoop":
        overall_estimates += 19.1
    elif device == "rope":
        overall_estimates += 18.6
elif country == "Bulgaria":
    if device == "ribbon":
        overall_estimates += 19
    elif device == "hoop":
        overall_estimates += 19.3
    elif device == "rope":
        overall_estimates += 18.9
elif country == "Italy":
    if device == "ribbon":
        overall_estimates += 18.7
    elif device == "hoop":
        overall_estimates += 18.8
    elif device == "rope":
        overall_estimates += 18.85

print(f"The team of {country} get {overall_estimates:.3f} on {device}.")
print(f"{(((20 - overall_estimates)/20)*100):.2f}%")

