# През годината Гришо участва в определен брой турнири, като за всеки турнир получава точки, които зависят от позицията,
# на която е завършил в турнира. Има три варианта за завършване на турнир:
# 	W - ако е победител получава 2000 точки
# 	F - ако е финалист получава 1200 точки
# 	SF - ако е полуфиналист получава 720 точки
# Напишете програма, която изчислява колко ще са точките на Григор след изиграване на всички турнири,
# като знаете с колко точки стартира сезона.
# Също изчислете колко точки средно печели от всички изиграни турнири и колко процента от турнирите е спечелил.

# От конзолата първо се четат два реда:
# •	Брой турнири, в които е участвал – цяло число в интервала [1…20]
# •	Начален брой точки в ранглистата - цяло число в интервала [1...4000]

# За всеки турнир се прочита отделен ред:
# •	Достигнат етап от турнира – текст – "W", "F" или "SF"
import math

number_tournaments = int(input())
points_in_ranking = int(input())
point = 0
win = 0
for _ in range(number_tournaments):
    stage_on_tournament = input()
    if stage_on_tournament == 'W':
        point += 2000
        win += 1
    elif stage_on_tournament == 'F':
        point += 1200
    elif stage_on_tournament == 'SF':
        point += 720
totall_point = point + points_in_ranking
print(f"Final points: {math.floor(totall_point)}")
print(f"Average points: {math.floor(point/number_tournaments)}")
print(f'{win/number_tournaments * 100:.2f}%')



# Средните точки да бъдат закръглени към най-близкото цяло число надолу, а процентът да се форматира до втората цифра
# след десетичния знак.