hour = int(input())
min = int(input())
min += 15            # min = min + 15
hour += min // 60    # (модулно деление)делим на 60 за да видим дали се променя часът (ще ни върне само часът)
min %= 60            # (цялочислено деление)делим на 60 за да видим дали се променят минутите (ще ни върне само минути)
if hour > 23:        # ако часът е по голям от 23 - става 0 часът
    hour = 0
if min <= 9:         # за да принтира 0 пред секудните ако са по малко от 9
    print(f'{hour}:0{min}')
else:
    print(f'{hour}:{min}')