# 1.	Кино
# В една кинозала столовете са наредени в правоъгълна форма в r реда и c колони.
# Има три вида прожекции с билети на различни цени:
# •	Premiere - премиерна прожекция, на цена 12.00 лева;
# •	Normal - стандартна прожекция, на цена 7.50 лева;
# •	Discount - прожекция за деца, ученици и студенти на намалена цена от 5.00 лева.
# Напишете програма, която чете тип прожекция (текст), брой редове и брой колони в залата (цели числа),
# въведени от потребителя, и изчислява общите приходи от билети при пълна зала.
# Резултатът да се отпечата във формат 2 знака след десетичната точка.
projection = input()
r = int(input())
c = int(input())
tiket_price = 0

if projection == 'Premiere':
    tiket_price = 12
elif projection == 'Normal':
    tiket_price = 7.5
elif projection == 'Discount':
    tiket_price = 5
total = (r * c) * tiket_price
print(f'{total:.2f}')