# 5.	Пътешествие
# Млад програмист разполага с определен бюджет и свободно време в даден сезон. Напишете програма,
# която да приема на входа бюджета и сезона, а на изхода да изкарва къде ще почива програмистът и колко ще похарчи.
# Бюджетът определя дестинацията, а сезонът - колко от бюджета ще изхарчи. Ако е лято ще почива на къмпинг,
# а зимата в хотел. Ако е в Европа, независимо от сезона, ще почива в хотел. Всеки къмпинг или хотел,
# според дестинацията, има собствена цена, която отговаря на даден процент от бюджета:
# •	При 100 лв. или по-малко - някъде в България:
# o	Лято - 30% от бюджета;
# o	Зима - 70% от бюджета.
# •	При 1000 лв. или по малко - някъде на Балканите:
# o	Лято - 40% от бюджета;
# o	Зима - 80% от бюджета.
# •	При повече от 1000 лв. - някъде из Европа:
# o	При пътуване из Европа, независимо от сезона, ще похарчи 90% от бюджета.
# Вход
# Входът се чете от конзолата и се състои от два реда, въведени от потребителя:
# •	Бюджет - реално число;
# •	Един от двата възможни сезона - "summer” или "winter”.
# Изход
# На конзолата трябва да се отпечатат два реда:
# •	 "Somewhere in [дестинация]" измежду "Bulgaria", "Balkans" и "Europe"
# •	"{Вид почивка} - {Похарчена сума}":
# o	Почивката може да е между "Camp" и "Hotel"
# o	Сумата трябва да бъде форматирана с точност до вторият знак след десетичната запетая
budget = float(input())
seasons = input()
destination = ''
type_of_vacation = ''
# •	При 100 лв. или по-малко - някъде в България:
# o	Лято - 30% от бюджета;
# o	Зима - 70% от бюджета.
if budget <= 100:
    destination = "Bulgaria"
    if seasons == 'summer':
        budget *= 0.3
        type_of_vacation = 'Camp'
    elif seasons == 'winter':
        budget *= 0.7
        type_of_vacation = 'Hotel'
# •	При 1000 лв. или по малко - някъде на Балканите:
# o	Лято - 40% от бюджета;
# o	Зима - 80% от бюджета.

elif budget <= 1000:
    destination = "Balkans"
    if seasons == 'summer':
        budget *= 0.4
        type_of_vacation = 'Camp'
    elif seasons == 'winter':
        budget *= 0.8
        type_of_vacation = 'Hotel'
# •	При повече от 1000 лв. - някъде из Европа:
# o	При пътуване из Европа, независимо от сезона, ще похарчи 90% от бюджета.
elif budget > 1000:
    destination = "Europe"
    budget *= 0.9
    type_of_vacation = 'Hotel'
print(f"Somewhere in {destination}")
print(f"{type_of_vacation} - {budget:.2f}")