# Да се напише конзолна програма, която прочита възраст (реално число) и пол ('m' или 'f'),
# въведени от потребителя, и отпечатва обръщение измежду следните:
# •	"Mr." – мъж (пол 'm') на 16 или повече години
# •	"Master" – момче (пол 'm') под 16 години
# •	"Ms." – жена (пол 'f') на 16 или повече години
# •	"Miss" – момиче (пол 'f') под 16 години
# Примерен вход и изход
# вход	изход		вход	изход		вход	изход		вход	изход
# 12
# f	Miss		17
# m	Mr.		25
# f	Ms.		13.5
# m	Master
# 1.	Създайте нов проект в PyCharm и му задайте описателно име, например
# "nested_conditional_statements";
# 2.	В проекта създайте Python файл с подходящо име, например "personal_titles".
# Вече имате проект с един файл в него. Остава да напишете кода за решаване на задачата.
age = float(input())
gender = input()
if gender == 'm':
    if age >= 16:
        print("Mr.")
    elif age < 16:
        print("Master")
elif gender == 'f':
    if age >= 16:
        print("Ms.")
    elif age < 16:
        print("Miss")
