# 1. Пазар за плодове
# Мария решава да мине на диета и отива до близкия пазар, за да купи ягоди, банани, портокали и
# малини. На конзолата се въвежда цената на ягодите в лв./кг. и количеството на бананите,
# портокалите, малините и ягодите, които трябва да закупи. Да се напише програма, която
# пресмята колко пари са ѝ необходими за да плати сметката, като знаете, че:
# • цената на малините е на половина по-ниска от тази на ягодите;
# • цената на портокалите е с 40% по-ниска от цената на малините;
# • цената на бананите е с 80% по-ниска от цената на малините.
# Вход
# От конзолата се четат 5 реда:
# 1. Цена на ягодите в лева – реално число в интервала [0.00 … 10000.00]
# 2. Количество на бананите в килограми – реално число в интервала [0.00 … 1 0000.00]
# 3. Количество на портокалите в килограми – реално число в интервала [0.00 … 10000.00]
# 4. Количество на малините в килограми – реално число в интервала [0.00 … 10000.00]
# 5. Количество на ягодите в килограми – реално число в интервала [0.00 … 10000.00]
# Изход
# Да се отпечата на конзолата едно число:
# • парите, които са необходими на Мария.
# Резултатът да се форматира до вторта цифра след десетичната запетая.

price_of_strawberries = float(input())
quantity_of_bananas = float(input())
quantity_of_oranges = float(input())
quantity_of_raspberries = float(input())
quantity_of_strawberries = float(input())
price_of_raspberries = price_of_strawberries / 2
price_of_oranges = price_of_raspberries * 0.60
price_of_bananas = price_of_raspberries * 0.20
total = (price_of_strawberries * quantity_of_strawberries) + (price_of_bananas * quantity_of_bananas) +\
         (price_of_oranges * quantity_of_oranges) + (price_of_raspberries * quantity_of_raspberries)
print(f'{total:.2f}')