# Симона и Светлин ще ходят на почивка в Африка и искат да отидат на сафари. Понеже за делничните дни вече
# имат планове, решават, че ще отидат събота или неделя. Напишете програма, която изчислява колко ще им
# струва ходенето на сафари и дали бюджетът им ще им стигне да отидат, като имате предвид следното:
# • Цената на един литър гориво е 2.10 лв.
# • Цената за екскурзовод е 100лв.
# • В зависимост от деня има отстъпки от общата цена - за събота 10%, а за неделя 20%
# Вход
# От конзолата се четат 3 реда:
#  Бюджет – реално число в интервала [0.00… 10000.00]
#  Колко литра гориво ще са им нужни – реално число в интервала [1.00… 50.00]
#  Ден от седмицата – текст с възможности "Saturday" и "Sunday"
# Изход
# Да се отпечата на конзолата един ред:
#  Ако бюджетът е достатъчен:
# "Safari time! Money left: {колко пари са им останали} lv. "
#  Ако бюджетът не е достатъчен:
# "Not enough money! Money needed: {колко пари не им достигат} lv."
# Сумите трябва да са форматирани до втория знак след десетичната запетая.

budget = float(input())
fuel_will_need = float(input())
day_of_the_week = input()

fuel_price = fuel_will_need * 2.10
# • Цената на един литър гориво е 2.10 лв.

needed_money = fuel_price + 100
# • Цената за екскурзовод е 100лв.
if day_of_the_week == "Saturday":
    needed_money *= 0.90
elif day_of_the_week == "Sunday":
    needed_money *= 0.80
# • В зависимост от деня има отстъпки от общата цена - за събота 10%, а за неделя 20%

diff = abs(needed_money - budget)
#  Ако бюджетът е достатъчен:
if budget > needed_money:
    print(f"Safari time! Money left: {diff:.2f} lv. ")
else:
#  Ако бюджетът не е достатъчен:
    print(f"Not enough money! Money needed: {diff:.2f} lv.")
