# Задача 6. Ветеринарен Паркинг
# Напишете програма, която пресмята колко общо трябва да се плати за престоя на колата на Деси на паркинга.
# Паркингът е различен от останалите и има разнообразен ценоразпис. За всеки четен ден и нечетен час,
# паркингът таксува 2.50 лева. Във всеки нечетен ден и четен час таксата е 1.25 лева,
# във всички останали случаи се заплаща 1 лев. Таксуването става на всеки изминал час от деня.
# Всеки един от изходите трябва да бъде закръглен до втория знак след десетичната запетая.
# Вход
# От конзолата се четaт два реда:
# •	Брой дни – цяло число в интервала [1 … 5]
# •	Брой часове за всеки един от дните - цяло число в интервала [1 … 24]
# Изход:
# Да се отпечата на конзолата:
# •	За всеки изминал ден, общата сума, която трябва да се плати – "Day: {индексът на деня} –
# {общата сума за деня} leva"
# •	Когато програмата приключи - "Total: {общата сума за всички дни} leva"





days = int(input())
hours = int(input())
price = 0
sum = 0
for i in range(1, days + 1):
    for i1 in range(1, hours + 1):
        if i % 2==0 and i1 % 2 != 0:
            price += 2.5
            sum += 2.5
        elif i % 2!=0 and i1 % 2 == 0:
            price += 1.25
            sum += 1.25
        else:
            price += 1
            sum += 1
    print(f'Day: {i} - {sum:.2f} leva')
    sum = 0

print(f"Total: {price:.2f} leva")