# 2.	Система за отчет
# На благотворително събитие плащанията за закупените продукти винаги се редуват: плащане в брой и плащане с карта.
# Установени са следните правила за заплащане:
# •	Ако продуктът надвишава 100лв., за него не може да се плати в брой
# •	Ако продуктът е на цена под 10лв., за него не може да се плати с кредитна карта
# Програмата приключва или след като получим команда "End" или след като средствата бъдат събрани.

# От конзолата се четат:
# •	Сумата, която се очаква да бъде събрана от продажбите - цяло число в интервала [1 ... 10000]
# На всеки следващ ред, до получаване на командата "End" или докато не се съберат нужните средства:
# цените на предметите,които ще бъдат закупени - цяло число в интервала [1 ... 500]

needed_sum = int(input())                                            # търсена сума
count = 0                                                            # брояч - дали е карта или в брой
sum = 0                                                              # обща сума
total_amount_in_cash = 0                                             # Цялата сума в кеш
total_amount_in_card = 0                                             # Цялата сума по карта
nomber_cash = 0                                                      # Колко пъти сме платили в кеш
nomber_card = 0                                                      # Колко пъти сме платили с карта

price = input()                                                      # вход сума
while price != "End":                                                # цикъл който ще преключи със Енд
    count += 1                                                       # плащане в брой
    money_price = int(price)                                         # обръщаме стринг в цяло число

    if money_price > 100 and count % 2 != 0:                         # ако е по голямо от 100 неможе да се плати в брой
        print(f'Error in transaction!')                              # принтираме че транзакцията не е валидна

    elif money_price <= 100 and count % 2 != 0:                      # ако е по голямо от 100 неможе да се плати в брой
        sum += money_price                                           # добавяме сумата
        total_amount_in_cash += money_price                          # добавяме към цялата сумата в кеш
        nomber_cash += 1                                             # броим че сме извършили плащане в кеш
        print('Product sold!')                                       # принтираме че е успешно

    if money_price < 10 and count % 2 == 0:                          # ако сумата е по малка от 10 не може да се заплати
        print(f'Error in transaction!')                              # принтираме че транзакцията не е валидна

    elif money_price >= 10 and count % 2 == 0:                       # всяка 2 транзакция е с карта
        sum += money_price                                           # добавяме сумата
        total_amount_in_card += money_price                          # добавяме към цялата сумата с карта
        nomber_card += 1                                             # броим че сме извършили плащане с карта
        print('Product sold!')                                       # принтираме че е успешно

    if sum >= needed_sum:

        print(f"Average CS: {(total_amount_in_cash / nomber_cash):.2f}")
        print(f"Average CC: {(total_amount_in_card / nomber_card):.2f}")
        break

    price = input()

else:
    print(f'Failed to collect required money for charity.')


