# 3.	Поток от букви
# Напишете програма, която прочита скрито съобщение в поредица от символи.
# Те се получават по един на ред до получаване на командата "End". Думите се образуват от буквите в реда на четенето им.
# Символите, които не са латински букви трябва да бъдат игнорирани. Думите скрити в потока са разделени от
# тайна команда от три букви – "c", "o" и "n". При първото получаване на една от тези букви,
# тя се маркира като срещната, но не се запазва в думата. При всяко следващо нейно срещане се записва нормално в думата.
# След като са налични и трите символа от командата, се печата думата и интервал " ". Започва се нова дума,
# която по същия начин чака тайната команда, за да бъде отпечатана.
#
# Вход
# От конзолата се чете поредица от редове с един символ на всеки до получаване на командата "End".


command = input()
word = ''
secret_command = ''

while command != "End":

    if command in("c""o""n"):
        secret_command += command

        if secret_command == 'con' or secret_command == 'onc' or secret_command == 'nco':
            print(word)
    command = input()


# Изход
# На конзолата се печата на един ред всяка дума след тайната команда, следвана от интервал.
# ToDo
# https://judge.softuni.org/Contests/Practice/Index/1684#2