# Ресторант отваря врати и предлага няколко менюта на преференциални цени:
# •	Пилешко меню –  10.35 лв.
# •	Меню с риба – 12.40 лв.
# •	Вегетарианско меню  – 8.15 лв.
# Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
# Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката).
# Цената на доставка е 2.50 лв и се начислява най-накрая.
# Вход
# От конзолата се четат 3 реда:
# •	Брой пилешки менюта – цяло число в интервала [0 … 99]
number_of_chicken_menus = int(input())
# •	Брой менюта с риба – цяло число в интервала [0 … 99]
number_of_fish_menus = int(input())
# •	Брой вегетариански менюта – цяло число в интервала [0 … 99]
number_of_vegetarian_menus = int(input())
chicken_menus = number_of_chicken_menus * 10.35
fish_menus = number_of_fish_menus * 12.40
vegetarian_menus = number_of_vegetarian_menus * 8.15
bill = chicken_menus + fish_menus + vegetarian_menus
total_bill = bill + (bill * 0.2) + 2.5
print(total_bill)

# Изход
# Да се отпечата на конзолата един ред:  "{цена на поръчката}"
# Примерен вход и изход
# Вход	Изход	Обяснения
# 2
# 4
# 3	116.2	Цена за пилешките менюта: 2 броя * 10.35  = 20.70
# Цена за менютата с риба: 4 броя * 12.40 = 49.60
# Цена за вегетарианските менюта: 3 броя * 8.15 = 24.45
# Обща цена на менютата: 20.70 + 49.60 + 24.45 = 94.75
# Цена на десерта: 20% от 94.75 = 18.95
# Цена на доставка: 2.50 (по условие)
# Обща цена на поръчката: 94.75 + 18.95 + 2.50 = 116.20
