# Румен иска да пребоядиса хола и за целта е наел майстори. Напишете програма, която изчислява разходите за ремонта,
# предвид следните цени:
# •	Предпазен найлон - 1.50 лв. за кв. метър
# •	Боя - 14.50 лв. за литър
# •	Разредител за боя - 5.00 лв. за литър
# За всеки случай, към необходимите материали, Румен иска да добави още 10% от количеството боя и 2 кв.м. найлон,
# разбира се и 0.40 лв. за торбички. Сумата, която се заплаща на майсторите за 1 час работа,
# е равна на 30% от сбора на всички разходи за материали.
# Вход
# Входът се чете от конзолата и съдържа точно 4 реда:
# 1.	Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
required_amount_of_nylon = int(input())
# 2.	Необходимо количество боя (в литри) - цяло число в интервала [1…100]
required_amount_of_paint = int(input())
# 3.	Количество разредител (в литри) - цяло число в интервала [1…30]
amount_of_thinner = int(input())
# 4.	Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]
hours_for_work = int(input())

amount_of_nylon = (required_amount_of_nylon + 2) * 1.5
amount_of_paint = (required_amount_of_paint + required_amount_of_paint * 0.1) * 14.5
thinner = amount_of_thinner * 5
total_cost = amount_of_nylon + amount_of_paint + thinner + 0.4


price_work = (total_cost * 0.3) * hours_for_work

total_price = price_work + total_cost

print(total_price)
# Изход
# Да се отпечата на конзолата един ред:
# •	"{сумата на всички разходи}"







10
11
4
8
727.09

# Сума за найлон: (10 + 2) * 1.50 = 18 лв.
# Сума за боя: (11 + 10%) * 14.50 = 175.45 лв.
# Сума за разредител: 4 * 5.00 = 20.00 лв.
# Сума за торбички: 0.40 лв.
# Обща сума за материали: 18 + 175.45 + 20.00 + 0.40 = 213.85 лв.
# Сума за майстори: (213.85 * 30%) * 8 = 513.24 лв.
# Крайна сума: 213.85 + 513.24 = 727.09 лв.
