# За лятната ваканция в списъка със задължителна литература на Жоро има определен брой книги.
# Понеже Жоро предпочита да играе с приятели навън, вашата задача е да му помогнете да изчисли
# колко часа на ден трябва да отделя, за да прочете необходимата литература.

# От конзолата се четат 3 реда:
# 1.	Брой страници в текущата книга – цяло число в интервала [1…1000]
number_of_pages = int(input())
# 2.	Страници, които прочита за 1 час – цяло число в интервала [1…1000]
pages_in_1_hour = int(input())
# 3.	Броят на дните, за които трябва да прочете книгата – цяло число в интервала [1…1000]
number_of_days_read = int(input())

total_time_to_read_book = number_of_pages / pages_in_1_hour

required_hours_per_day = total_time_to_read_book / number_of_days_read

print(int(required_hours_per_day))