# Задача 1. Приход на агенция
# Напишете програма, която изчислява печалбата на агенция за продажба на самолетни билети.
# Агенцията продава самолетни билети на различни авиокомпании.
# Ще получите информация за броя продадени билети за възрастни и броя продадени детски билети.
# Нетната цена на билета за възрастен се определя от авиокомпанията, а детският билет е със 70% по-евтин.
# Агенцията добавя към нетната цена на всеки билет такса обслужване.
# Крайната печалба на Агенцията е 20% от общата цена на всички билети.
# Вход:
# От конзолата се четат 5 реда:
# 1.	Име на авиокомпанията - текст
# 2.	Брой билети за	 възрастни – цяло число в диапазона [1…400]
# 3.	Брой детски билети – цяло число в диапазона [25…120]
# 4.	Нетна цена на билет за възрастен – реално число в диапазона [100.0…1600.0]
# 5.	Цената на такса обслужване - реално число в диапазона [10.0…50.0]
# Изход:
# Да се отпечата на конзолата крайната печалбата от продажбите, в следния формат:
# •	"The profit of your agency from {име на авиокомпанията} tickets is {печалба за агенцията} lv."
# Цената на печалбата да бъде форматирана до втората цифра след десетичния знак.

name_of_the_airline = input()
number_of_tickets_for_adults = int(input())
number_of_children_tickets = int(input())
adult_ticket_price = float(input())
service_fee = float(input())
profit_for_agency = 0
children_ticket_price = adult_ticket_price * 0.3
all_fee = (number_of_children_tickets + number_of_tickets_for_adults ) * service_fee
sum = ((number_of_tickets_for_adults * adult_ticket_price) + (number_of_children_tickets * children_ticket_price)\
      + all_fee) * 0.2
print(f"The profit of your agency from {name_of_the_airline} tickets is {sum:.2f} lv.")