# 7.	Преместване

# Той започва да пренася своя багаж на части, защото не може наведнъж. Има ограничено свободно пространство в
# новото си жилище, където може да разположи вещите, така че мястото да бъде подходящо за живеене.
# Напишете програма, която изчислява свободния обем от жилището на Хосе, който остава, след като пренесе багажа си.
# Всеки кашон е с точни размери:  1m x 1m x 1m.
# Вход
# Потребителят въвежда следните данни на отделни редове:
# 1.	Широчина на свободното пространство - цяло число;
# 2.	Дължина на свободното пространство - цяло число;
# 3.	Височина на свободното пространство - цяло число;
# 4.	На следващите редове (до получаване на команда "Done") - брой кашони, които се пренасят в квартирата - цели числа
# Програмата трябва да приключи прочитането на данни при команда "Done" или ако свободното място свърши.
# Изход
# Да се отпечата на конзолата един от следните редове:
# -	Ако стигнете до командата "Done" и има още свободно място:
# "{брой свободни куб. метри} Cubic meters left."
# -	Ако свободното място свърши преди да е дошла команда "Done":
# "No more free space! You need {брой недостигащи куб. метри} Cubic meters more."
width = int(input())
length = int(input())
height = int(input())
free_space = width * length * height
free_space_full = False
command = input()

while command != "Done":
    number_of_cartons = int(command)
    free_space -= number_of_cartons
    if free_space < 0:
        free_space_full = True
        break
    command = input()
if free_space_full:
    print(f'No more free space! You need {abs(free_space)} Cubic meters more.')
else:
    print(f'{abs(free_space)} Cubic meters left.')