# 3.	Почивка

# Тя спестява или харчи част от парите си всеки ден. Ако иска да похарчи повече от наличните си пари,
# то тя ще похарчи колкото има и ще ѝ останат 0 лева.
# Вход
# От конзолата се четат:
# •	Пари, нужни за екскурзията - реално число;
# •	Налични пари - реално число.
# След това многократно се четат по два реда:
# •	Вид действие – текст с две възможности: "spend" или "save";
# •	Сумата, която ще спести/похарчи - реално число.

price_for_trip = float(input()) # •	Пари, нужни за екскурзията - реално число;
money_on_hand = float(input())  # •	Налични пари - реално число.
spend = 0                       # •	Ако 5 последователни дни Джеси само харчи (spend брояч)
count = 0                       #   Общ брой изминали дни

while spend < 5:                # •	Ако 5 последователни дни Джеси само харчи - излизаме от цикалът
    count += 1                  #   изминали дни
    spend_or_save = input()     # •	Вид действие – текст с две възможности: "spend" или "save";
    amount = float(input())     # •	Сумата, която ще спести/похарчи - реално число.

    if spend_or_save == "spend": # ако харчи
        spend += 1               # увеличаваме броя харчения
        money_on_hand -= amount  # изваждаме сумата от наличните пари

        if money_on_hand < 0:   # ако наличните пари станат по малко от 0
            money_on_hand = 0   # връщаме им стойност 0 (Ако иска да похарчи повече от наличните си пари,то тя ще похарчи колкото има и ще ѝ останат 0 лева.)

    elif spend_or_save == "save":# ако спестява
        spend = 0                # зануляваме брояча за харчене
        money_on_hand += amount  # добавяме сумата към наличните пари

    if money_on_hand >= price_for_trip: # ако е сънрала парите прекъсваме цикалът
        break


if money_on_hand >= price_for_trip: # ако е сънрала парите принтираме това
    print(f'You saved the money for {count} days.')
else:
    print("You can't save the money.") # ако не е сънрала парите принтираме това
    print(f"{count}")






