# 8.	Завършване
# Напишете програма, която изчислява средната оценка на ученик от цялото му обучение.
# На първия ред ще получите името на ученика, а на всеки следващ ред неговите годишни оценки.
# Ученикът преминава в следващия клас, ако годишната му оценка е по-голяма или равна на 4.00.
# Ако ученикът бъде скъсан повече от един път, то той бива изключен и програмата приключва,
# като се отпечатва името на ученика и в кой клас бива изключен.
#  При успешно завършване на 12-ти клас да се отпечата :
# "{име на ученика} graduated. Average grade: {средната оценка от цялото обучение}"
# В случай, че ученикът е изключен от училище, да се отпечата:
# "{име на ученика} has been excluded at {класа, в който е бил изключен} grade"
# Стойността трябва да бъде форматирана до втория знак след десетичната запетая.


name = input()
evaluation_sum = 0
torn_on_exam = 0
count = 1

while count <= 12:
    evaluation = float(input())
    if evaluation < 4:
        torn_on_exam +=1
        if torn_on_exam == 2:
            break
    else:
        evaluation_sum += evaluation
        count += 1


if torn_on_exam == 2:
    print(f"{name} has been excluded at {count} grade")
else:
    print(f"{name} graduated. Average grade: {evaluation_sum / 12:.2f}")
