# Задача 1. Калкулатор за сериали
# Напишете програма, която изчислява колко време ще ви отнеме да изгледате всички епизоди на един сериал в минути.
# Ще разполагате с брой сезони, брой епизоди на сезон и времетраене на един епизод. Във всеки епизод има реклами,
# които са с продължителност 20% от времето на един епизод. Също така знаете, че всеки сезон завършва със специален епизод,
# който е с 10м по-дълъг от обичайното.
# Вход
# От конзолата се четат 4 реда:
# •	Име на сериал - текст
# •	Брой сезони – цяло число в диапазона [1… 10]
# •	Брой епизоди  – цяло число в диапазона [10… 80]
# •	Времетраене на обикновен епизод без рекламите – реално число в диапазона [40.0… 65.0]
import math

name_of_series = input()
number_of_seasons = int(input())
number_of_episodes = int(input())
duration_without_ads = float(input())
duration = duration_without_ads * 1.20
special_episot = number_of_seasons * 10
time = ((number_of_episodes * duration) * number_of_seasons) + special_episot

print(f"Total time needed to watch the {name_of_series} series is {math.floor(time)} minutes.")



# Изход
# Да се отпечата на конзолата времето, необходимо за изглеждане на всички епизоди, закръглено до
# най-близкото цяло число надолу в следния формат:
# "Total time needed to watch the {име на сериал} series is {време} minutes."
