# Той разполага с определен бюджет, който е предвидил, за да купи козунаци и боядисани яйца.
# Известно е, че един козунак стига за трима човека, като всеки гост ще получи и по 2 яйца.
# Вашата задача е да намерите колко козунака и яйца трябва да купи Любо, както и каква ще е сумата,
# която той трябва да плати и дали бюджета му е достатъчен. При изчисляването на броя козунаци, които
# Любо трябва да закупи, техният брой трябва да се закръгли към по-голямото цяло число.  Ако парите не му стигат,
# трябва да се изведе съобщение, колко не му достигат.
# Известно е, че:

# •	Един козунак струва 4лв.
# •	Едно яйце струва 0.45лв.
# един козунак стига за трима човека
# всеки гост ще получи и по 2 яйца
# При изчисляването на броя козунаци, техният брой трябва да се закръгли към по-голямото цяло число
import math

number_of_guest = int(input())
budget = float(input())
easter_bread = math.ceil(number_of_guest / 3)
egg = number_of_guest * 2
sum = (egg * 0.45) + (easter_bread * 4)
final_sum = abs(budget - sum)
if sum <= budget:
    print(f"Lyubo bought {easter_bread} Easter bread and {egg} eggs.")
    print(f"He has {final_sum:.2f} lv. left.")
else:
    print(f"Lyubo doesn't have enough money.")
    print(f"He needs {final_sum:.2f} lv. more.")

# Парите да бъдат форматирани до втората цифра след десетичния знак.
