# Задача 4. Великденски магазин
# Покрай великденските празници, квартален магазин започва да продава боядисани яйца. Вашата задача е да напишете
# програма, която да изчислява колко яйца са продадени, като знаете началната им бройка в магазина.
# По време на продажбата е възможно да бъдат доставени допълнителни бройки яйца.
# Ако в даден момент от изпълнението на програмата, клиент поиска да купи повече, отколкото има в наличност,
# или се получи команда "Close", програмата трябва да приключи изпълнение.
# Вход
# От конзолата се чете:
# •	На първи ред - Началното количество яйца в магазина - цяло число в интервала [1… 10000]
# •	След това поредица от два реда (до получаване на команда "Close"
# o	Команда за купуване или допълване на яйца в магазина – текст ("Buy" или "Fill")
# o	Брой на яйца, които да бъдат купени или допълнени в магазина – цяло число в интервала
# [1… 1000]
quantity_of_eggs = int(input())
buy_or_fill = input()
sell_egg = 0
while buy_or_fill != "Close":
    number_of_eggs = int(input())

    if buy_or_fill == "Buy":
        if number_of_eggs > quantity_of_eggs:
            print(f"Not enough eggs in store!")
            print(f"You can buy only {quantity_of_eggs}.")
            break
        else:
            quantity_of_eggs -= number_of_eggs
            sell_egg += number_of_eggs
    elif buy_or_fill == "Fill":
        quantity_of_eggs += number_of_eggs

    buy_or_fill = input()

else:
    print(f"Store is closed!")
    print(f"{sell_egg} eggs sold.")
# Изход
# На конзолата да се отпечатат два реда според случая:

# •	При заявка за покупка на повече яйца, отколкото има в магазина:
# o	"Not enough eggs in store!"
# o	"You can buy only {броя на останалите в магазина яйца}."
# Примерен вход и изход
