# Задача 1. Великденска пекарна
#
# •	цената на килограм захар е с 25% по-ниска от тази на килограм брашно
# •	цената на една кора с яйца е с 10% по-висока от цената на килограм брашно
# •	цената на един пакет мая е с 80% по-ниска от цената на килограм захар
# Вход
# От конзолата се четат 5 реда:
# 1.	Цена на брашното за един килограм – реално число в интервала [0.00 … 10000.00]
# 2.	Килограми на брашното – реално число в интервала [0.00 … 10000.00]
# 3.	Килограми на захарта – реално число в интервала [0.00 … 10000.00]
# 4.	Брой кори с яйца – цяло число в интервала [0 … 10000]
# 5.	Пакети мая  – цяло число в интервала [0 … 10000]

price_of_flour_per_kilogram = float(input())
kilogram_of_flour = float(input())
kilogram_of_sugar = float(input())
number_of_eggshells = int(input())
packages_of_yeast = int(input())
sugar_price = price_of_flour_per_kilogram * 0.75
eggshells_price = price_of_flour_per_kilogram * 1.1
yeast_price = sugar_price * 0.20
total = (price_of_flour_per_kilogram * kilogram_of_flour) + (kilogram_of_sugar * sugar_price) + \
        (number_of_eggshells * eggshells_price) + (yeast_price * packages_of_yeast)
print(f'{total:.2f}')

# Цена на захарта за килограм: 50 * 0.75 = 37.5 лв.
# Цена на яйцата за кора: 50 * 1.1 = 55 лв.
# Цена на маята за пакет: 37.5 * 0.2 = 7.5 лв.
# Сума за брашното: 50 * 10 = 500 лв.
# Сума за захарта: 37.5 * 3.5 = 131.25 лв.
# Сума за яйцата: 55 * 6 = 330 лв.
# Сума за маята: 7.5 * 1 = 7.5 лв.
# Обща сума: 500 + 131.25 + 330 + 7.5 = 968.75 лв.

