# Задача 5. Разпродажба на екскурзии
# Туристическа фирма разпродава финални екскурзионни пакети за края на годината. Напишете програма, която да изчислява,
# печалбата от разпродажбата и дали са продадени всички пакети или не,
# като знаете първоначалния брой екскурзии и техните цени.
# Фирмата предлага два вида екскурзии – море ("sea") на цена 680 лева и планина ("mountain") на цена 499 лева.
# При избор на даден пакет, към общата сума се добавя съответната цена. При избор на пакет,
# който вече не е наличен (броят му е равен на 0), не трябва да се добавя към общата цена.
# Вход:
# От конзолата първоначално се четат 2 реда:
# 1.	Брой екскурзии за море – цяло число в интервала [1… 500]
# 2.	Брой екскурзии за планина – цяло число в интервала [1… 500]
# След това се чете по един ред до получаване на команда "Stop" или докато фирмата не продаде всички пакети:
# •	Име на пакет – текст с възможности "sea" или "mountain"

number_of_sea_excursions = int(input())
number_of_mountain_excursions = int(input())
total = 0
command = input()

while command != "Stop":

    if command == "sea":
        if number_of_sea_excursions > 0:
            total += 680
            number_of_sea_excursions -= 1

    elif command == "mountain":
        if number_of_mountain_excursions > 0:
            total += 499
            number_of_mountain_excursions -= 1


    if number_of_mountain_excursions == 0 and number_of_sea_excursions == 0:
        print(f"Good job! Everything is sold.")
        break
    command = input()
print(f"Profit: {total} leva.")








# Изход:
# На конзолата се отпечатват 1 или  2 реда, според случая:
# •	Ако фирмата е успяла да продаде всички пакети:
# " Good job! Everything is sold."
# Винаги се отпечатва:
# "Profit: {печалба от продажбите} leva."
