# Иван искал да си купи няколко части за неговия компютър и отишъл в магазин. Понеже там нямало частите в наличност,
# те трябвало да ги поръчат. Той искал да си купи процесор, видео карта и RAM памет,
# като за процесора и видео картата магазинът му прави няколко процента отстъпка. Всичко трябвало да плати в долари,
# затова трябва цените да се обърнат в лева, като приемем, че 1 долар = 1.57 лева.
# Да се напише програма, която пресмята колко общо пари ще му трябват в лева, за да може да си закупи частите.
# Вход
# От конзолата се прочитат 5 реда:
# •	На първи ред: цената в долари за процесора – реално число в интервала [200.00 … 3000.00]
# •	На втори ред: цената в долари за видео карта – реално число в интервала [100.00 … 1500.00]
# •	На трети ред: цената в долари за една RAM памет – реално число в интервала [80.00 ... 500.00]
# •	На четвърти: ред брой RAM памети – цяло число в интервала [1 ... 4]
# •   На пети ред: процент отстъпка – реално число в интервала [0.01 … 0.1]


price_for_processor = float(input())
price_for_video_card = float(input())
price_for_one_ram = float(input())
number_of_ram = int(input())
discount = float(input())
price_for_video_card *= abs(((discount*100)-100)/100)
price_for_processor *= abs(((discount*100)-100)/100)

usd = 1.57
sum = (price_for_processor + price_for_video_card + (price_for_one_ram * number_of_ram)) * usd

print(f"Money needed - {sum:.2f} leva.")
