# Задача 1. Басейн
# Преподавателският екип на СофтУни организира работен ден на басейн по случай настъпването на лятото.
# Вашата задача е да напишете програма, която да изчислява каква сума трябва да се заплати. За всеки един
# човек от екипа трябва да се заплати такса вход. Трябва да имате предвид, че един чадър стига за двама
# души. Знае се, че само 75% от екипа искат шезлонги. При изчислението на броя на чадърите и шезлонгите,
# техният брой да се закръгли до по-голямото цяло число.
# Вход
# От конзолата се четат 4 числа:
# 1. Първи ред – брой на хората. Цяло число в интервала [1…100]
# 2. Втори ред – такса вход. Реално число в интервала [0.00…50.00]
# 3. Трети ред – цена един за шезлонг. Реално число в интервала [0.00…50.00]
# 4. Четвърти ред – цена за един чадър. Реално число в интервала [0.00...50.00]
# Изход
# "{сумата за покриване на разходите} lv."
# Резултатът да се форматира до втората цифра след десетичния знак
import  math
number_of_people = int(input())
entrance_fee = float(input())
deck_chair_price = float(input())
umbrella_price = float(input())
enter = number_of_people * entrance_fee
deck_chair = math.ceil(number_of_people * 0.75) * deck_chair_price
umbrella = math.ceil(number_of_people / 2) * umbrella_price
need_money = enter + deck_chair + umbrella
print(f"{need_money:.2f} lv.")
