# 1.Билети за мач
# Когато пуснали билетите за Евро 2016, група запалянковци решили да си закупят.
# Билетите имат две категории с различни цени:
# •	IP – 499.99 лева.
# •	Normal – 249.99 лева.
# Запалянковците имат определен бюджет, а броят на хората в групата определя какъв
# процент от бюджета трябва да се задели за транспоОт 1 до 4 – 75% от бюджета.
# •	От 5 до 9 – 60% от бюджета.
# •	От 10 до 24 – 50% от бюджета.
# •	От 25 до 49 – 40% от бюджета.
# •	50 или повече – 25% от бюджета.
# Напишете програма, която да пресмята дали с останалите пари от бюджета могат
# да си купят билети за избраната категория. И колко пари ще им останат или ще са им нужни.
# Вход
# Входът се чете от конзолата и съдържа точно 3 реда:
# •	На първия ред е бюджетът – реално число в интервала [1 000.00 ... 1 000 000.00]
# •	На втория ред е категорията – "VIP" или "Normal"
# •	На третия ред е броят на хората в групата – цяло число в интервала [1 ... 200]
# Изход
# Да се отпечата на конзолата един ред:
# •	Ако бюджетът е достатъчен:
# o	"Yes! You have {останалите пари на групата} leva left."
# •	Ако бюджетът НЕ Е достатъчен:
# o	"Not enough money! You need {сумата, която не достига} leva."
# Сумите трябва да са форматирани с точност до два знака след десетичната запетая.

budget = float(input())
category = str.lower(input())
number_of_people = int(input())

vip_ticket = 499.99
normal_ticket = 249.99
# намираме транспорта
if 1 <= number_of_people <= 4:
    budget *= 0.25
# 1 до 4 – 75% от бюджета.

elif 5 <= number_of_people <= 9:
    budget *= 0.4
# •	От 5 до 9 – 60% от бюджета.
elif 10 <= number_of_people <= 24:
    budget *= 0.5
# •	От 10 до 24 – 50% от бюджета.
elif 25 <= number_of_people <= 49:
    budget *= 0.6
# •	От 25 до 49 – 40% от бюджета.
else:
    budget *= 0.75
# •	50 или повече – 25% от бюджета.
# намираме категорията
ticket_prise = 0
if category == 'vip':
    ticket_prise = number_of_people * vip_ticket
else:
    ticket_prise = number_of_people * normal_ticket
total_prise = abs(budget - ticket_prise)
# need_money = total_prise - budget
if budget >= ticket_prise:
    print(f'Yes! You have {total_prise:.2f} leva left.')
else:
    print(f'Not enough money! You need {total_prise:.2f} leva.')

