# 7.Футболен турнир
# Първоначално прочитаме от конзолата капацитета на стадиона иброят на всички фенове.
# След това за всеки фен се чете секторът, в който се намира.
# Феновете на първия отбор са в сектор А и Б, а на втория – В и Г. Да се напише програма, която изчислява
# процентите на феновете във всеки сектор, спрямо общия брой фенове на стадиона, както и общият процент на феновете
# за двата отбора, спрямо капацитета на стадиона. Общият брой на феновете НЕ надвишава капацитета на стадиона.
# Вход
# От конзолата се четат поредица от числа, всяко на отделен ред:
# 1.	Капацитетът на стадиона – цяло число в интервала [1 … 10000];
# 2.	Броят на всички фенове – цяло число в интервала [1 … 10000].
# За всеки един фен, на отделен ред се прочита:
# 1.	Секторът, на който се намира – текст – "A", "B", "V" и "G".

capacity_of_stadium = int(input())
number_of_fans = int(input())
a = 0
b = 0
v = 0
g = 0



for i in range(number_of_fans):
    sector = input()
    if sector == "A":
        a +=1
    elif sector == "B":
        b +=1
    elif sector == "V":
        v +=1
    elif sector == "G":
        g +=1
sum = ((a + b +v +g) / capacity_of_stadium) * 100

# Изход
# Да се отпечатат на конзолата 5 реда, всеки от които съдържа процент между 0.00% и 100.00%,
# форматирани до втората цифра след десетичната запетая:
print(f'{((a/number_of_fans)* 100):.2f}%')
print(f'{((b/number_of_fans)* 100):.2f}%')
print(f'{((v/number_of_fans)* 100):.2f}%')
print(f'{((g/number_of_fans)* 100):.2f}%')
print(f'{sum:.2f}%')
