# Напишете програма, която да пресмята резултата от игра. Първо получавате число, което показва колко хода ще
# продължи играта.
# После за всеки ход на играта ще получавате по едно ново число. Според интервала в който попада
# числото се прибавят точки. Ако числото е отрицателно или по-голямо 50, тогава то е невалидно. В началото на играта
# резултата е 0 и на всеки ход се прибавят точки по следният начин:
# •	От 0 до 9  20 % от числото
# •	От 10 до 19  30 % от числото
# •	От 20 до 29  40 % от числото
# •	От 30 до 39  50 точки
# •	От 40 до 50  100 точки
# •	Невалидно число  резултата се дели на 2
# Освен резултата програмата трябва да изкарва статистика за проценти числа в дадените интервали.
# Вход
# Входът се чете от конзолата:
# •	Първи ред - колко хода ще има по време на играта – цяло число в интервала [1...100]
# •	За всеки ход – числата, които се проверяват в кой интервал са – цели числа в интервала [-100...100]
# Изход
# Да се отпечата на конзолата 7 реда:
# •	1ви ред: "{Краен резултат}"
# •	2ри ред: "From 0 to 9: {процент в интервала}%"
# •	3ти ред: "From 10 to 19: {процент в интервала}%"
# •	4ти ред: "From 20 to 29: {процент в интервала}%"
# •	5ти ред: "From 30 to 39: {процент в интервала}%"
# •	6ти ред: "From 40 to 50: {процент в интервала}%"
# •	7ми ред: "Invalid numbers: {процент в интервала}%"
# Всички числа трябва да са форматирана до вторият знак след запетаята.
move_of_game = int(input())
result = 0
to_9 = 0
to_19 = 0
to_29 = 0
to_39 = 0
to_50 = 0
invalid_numbers = 0
for i in range(move_of_game):
    number = int(input())
    if 0 <= number <= 9:
        result += number * 0.20
        to_9 += 1
    elif 10 <= number <= 19:
        result += number * 0.30
        to_19 += 1
    elif 20 <= number <= 29:
        result += number * 0.40
        to_29 += 1
    elif 30 <= number <= 39:
        result += 50
        to_39 += 1
    elif 40 <= number <= 50:
        result += 100
        to_50 += 1
    else:
        invalid_numbers += 1
        result /= 2

percentage_to_9 = (to_9 / move_of_game) * 100
percentage_to_19 = (to_19 / move_of_game) * 100
percentage_to_29 = (to_29 / move_of_game) * 100
percentage_to_39 = (to_39 / move_of_game) * 100
percentage_to_50 = (to_50 / move_of_game) * 100
percentage_invalid_numbers = (invalid_numbers / move_of_game) * 100
print(f'{result:.2f}')
print(f'From 0 to 9: {percentage_to_9:.2f}%')
print(f'From 10 to 19: {percentage_to_19:.2f}%')
print(f'From 20 to 29: {percentage_to_29:.2f}%')
print(f'From 30 to 39: {percentage_to_39:.2f}%')
print(f'From 40 to 50: {percentage_to_50:.2f}%')
print(f'Invalid numbers: {percentage_invalid_numbers:.2f}%')