# 2.	Поспаливата котка Том
# Котката Том обича по цял ден да спи, за негово съжаление стопанинът му си играе с него винаги когато  има свободно
# време. За да се наспи добре, нормата за игра на Том е 30 000  минути в година. Времето за игра на Том зависи
# от почивните дни на стопанина му:
# •	Когато е на работа, стопанинът му си играе с него по 63 минути на ден.
# •	Когато почива, стопанинът му си играе с него  по 127 минути на ден.
# Напишете програма, която въвежда броя почивни дни и отпечатва дали Том може да се наспи добре и колко
# е разликата от нормата за текущата година, като приемем че годината има 365 дни.
# Пример: 20 почивни дни -> работните дни са 345 (365 – 20 = 245). Реалното време за игра е 24 275 минути
# (345 * 63 + 20 *127).  Разликата от нормата е 5 725 минути (30 000 – 24 275 = 5 725) или 95 часа и 25 минути.
# Вход
# Входът се чете от конзолата и се състои от едно число – броят почивни дни – цяло число в интервала [0...365]

free_days = int(input())
work_days = 365 - free_days
time_to_play = (free_days * 127) +(work_days * 63)
normal_sleep = abs(30000 - time_to_play)
h = normal_sleep // 60
m = normal_sleep % 60

if time_to_play > 30000:
    print('Tom will run away')
    print(f'{h} hours and {m} minutes more for play')
else:
    print('Tom sleeps well')
    print(f'{h} hours and {m} minutes less for play')
